tests/events-service/load.yml
config:
  environments:
    dev:
      # Configuration service is behind the event service
      target: 'https://configuration-service.adsp-dev.gov.ab.ca'
  defaults:
    headers:
      Content-Type: 'application/json'
      Accept: 'application/json'
  payload:
    - path: '../artillery.{{  $processEnvironment.ARTILLERY_ENV }}.csv'
      skipHeader: true
      fields:
        - 'keycloak_url'
        - 'realm_id'
        - 'configuration-service-host'
        - 'client_id'
  variables:
    tenant:
      - 'demo'
      - 'platform'
  processor: '../my-functions.js'
  phases:
    - name: warm up
      duration: 10
      arrivalRate: 2
before:
  flow:
    - log: 'Getting the access token (tenant: {{ realm_id }}) {{ keycloak_url }}/auth/realms/{{ realm_id }}/protocol/openid-connect/token'
    - post:
        url: '{{ keycloak_url }}/auth/realms/{{ realm_id }}/protocol/openid-connect/token'
        headers:
          Content-Type: 'application/x-www-form-urlencoded'
          Accept: 'application/json'
        form:
          {
            grant_type: 'client_credentials',
            client_id: '{{ client_id }}',
            client_secret: '{{ $processEnvironment.ARTILLERY_CLIENT_SECRET  }}',
          }
        capture:
          - json: '$.access_token'
            as: token
scenarios:
  - name: 'get events list, create events and delete events'
    weight': 25
    flow:
      - get:
          url: /configuration/v2/configuration/platform/event-service/latest
          headers:
            authorization: 'Bearer {{ token }}'